---
kind: other
id: Methods.T:Autodesk.Revit.DB.Steel.SteelElementProperties
source: html/5188acc4-5f5e-8e90-8e94-610b7cff3bff.htm
---
# SteelElementProperties Methods

This method adds fabrication information to the given elements.